Revit 2026 API

# AreaBasedLoadBoundaryLineData Class

---

Wrapper class used to access area based load boundary line related data.

SystemObject Autodesk.Revit.DB.ElectricalAreaBasedLoadBoundaryLineData

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaBasedLoadBoundaryLineData : IDisposable
```
```vb
Public Class AreaBasedLoadBoundaryLineData
	Implements IDisposable
```
```cpp
public ref class AreaBasedLoadBoundaryLineData : IDisposable
```
```fsharp
type AreaBasedLoadBoundaryLineData =
    class
        interface IDisposable
    end
```

The AreaBasedLoadBoundaryLineData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BottomLevelId | The bottom level id of the area based load boundary line. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TopLevelId | The top level id of the area based load boundary line. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AreaBasedLoadBoundaryLineData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLevelIdsInRange | Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsElevationWithinRange | Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line. |
|  | IsLevelWithinRange | Checks whether the given level is between the bottom level and the top level (including the bottom level and the top level) of the area based load boundary line. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace